# 数值操作

## 数值替换

### 一对一替换

In [23]:
import pandas as pd
import numpy as np
df = pd.read_excel(r"D:\db\test01.xlsx",sheet_name =6)
#对某一列进行数值替换
df["年龄"].replace(240,33,inplace = True)
df
#对全表中的缺失值进行替换
df.replace(np.NaN,0)

  订单编号 客户姓名  唯一识别码    年龄                 成交时间
0   A1   张通  101.0  31.0  2018-08-08 00:00:00
1    0    0    0.0   0.0                    0
2   A2   李谷  102.0  45.0  2018-08-09 00:00:00
3   A3   孙凤  103.0  23.0  2018-08-10 00:00:00
4   A4   赵恒  104.0  33.0  2018-08-11 00:00:00
5   A5   赵恒  104.0  33.0  2018-08-12 00:00:00

### 多对一替换

In [26]:
import pandas as pd
import numpy as np
df = pd.read_excel(r"D:\db\test01.xlsx",sheet_name =6)
#多对一用replace([A,B],C)方法，表示将A、B替换成C
df.replace([240,260,280],35)

  订单编号 客户姓名  唯一识别码    年龄       成交时间
0   A1   张通  101.0  31.0 2018-08-08
1  NaN  NaN    NaN   NaN        NaT
2   A2   李谷  102.0  45.0 2018-08-09
3   A3   孙凤  103.0  23.0 2018-08-10
4   A4   赵恒  104.0  35.0 2018-08-11
5   A5   赵恒  104.0  35.0 2018-08-12

### 多对多替换

In [34]:
import pandas as pd
import numpy as np
df = pd.read_excel(r"D:\db\test01.xlsx",sheet_name =6)
#多对多的替换借助replace()方法，用字典的形式表示,replace({"A":"a","B":"b"})表示用a替换A，用b替换B.
df.replace({240:32,260:33,280:34})

  订单编号 客户姓名  唯一识别码    年龄       成交时间
0   A1   张通  101.0  31.0 2018-08-08
1  NaN  NaN    NaN   NaN        NaT
2   A2   李谷  102.0  45.0 2018-08-09
3   A3   孙凤  103.0  23.0 2018-08-10
4   A4   赵恒  104.0  32.0 2018-08-11
5   A5   赵恒  104.0  33.0 2018-08-12
6   A6   王丹  105.0  34.0 2018-08-12

## 数值排序

### 按照一定数值进行排序

In [46]:
import pandas as pd
import numpy as np
df = pd.read_excel(r"D:\db\test01.xlsx",sheet_name =7)
#df.sort_values(by=["col"],ascending = False) 默认是升序
#按照销售ID进行升序排序
df.sort_values(by=["销售ID"])
#按照销售ID进行降序排序
df.sort_values(by=["销售ID"],ascending= False)

  订单编号 客户姓名  唯一识别码   年龄       成交时间  销售ID
4   A5   王娜    105   21 2018-08-11     3
1   A2   李谷    102   45 2018-08-09     2
3   A4   赵恒    104  240 2018-08-11     2
0   A1   张通    101   31 2018-08-08     1
2   A3   孙凤    103   23 2018-08-10     1